Revit 2026 API

# WallCreateProfileSketch Method

---

Creates a new Wall profile Sketch.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Sketch CreateProfileSketch()
```
```vb
Public Function CreateProfileSketch As Sketch
```
```cpp
public:
Sketch^ CreateProfileSketch()
```
```fsharp
member CreateProfileSketch : unit -> Sketch
```

#### Return Value

Sketch Created profile Sketch of the Wall.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Wall does not support profile Sketch as it is not a straight wall; or is tapered; or it is an old curtain wall; or it is an infill wall; or it is a replacement curtain panel. -or- Wall already has a sketch. |

The loop of the sketch cannot be obtained until regeneration. To regenerate the document use [!:Autodesk::Revit::DB::Document::Regenerate()]. To edit the Wall profile use [!:Autodesk::Revit::DB::SketchEditScope].

#### Reference

Wall Class

Autodesk.Revit.DB Namespace